ams/src/Documents/AMS_ЛогистическийЛист/AMS_ЛогистическийЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ЛогистическийЛист</name>
  <registerRecords>InformationRegister._Рейсы</registerRecords>
  <registerRecords>InformationRegister._РейсыРаспоряжения</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаВодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПропуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАгента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗагрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗагрузкиФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распоряжения</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВМаршруте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъединеннаяЗагрузка</name>
      <type>
        <types>DocumentRef.AMS_ОбъединеннаяЗагрузка</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>DocumentRef.AMS_ПередачаВПереработку</types>
        <types>DocumentRef.ОтгрузкаТоваровКлиенту</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАдресаДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьЧек</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЧека</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьНарушениеДоговора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоговора</name>
      <type>
        <types>EnumRef._ПунктыДоговора</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаШтрафа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьПретензия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеПретензии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПретензии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подвоз</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтменыДоставки</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтменыДоставки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>EnumRef._ПричиныОтменыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратыТоваров</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтменыДоставки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>EnumRef._ПричиныОтменыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизацияЗаказа</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЧека</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоговора</name>
      <type>
        <types>EnumRef._ПунктыДоговора</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаШтрафа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеПретензии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПретензии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подвоз</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Catalogs/AMS_АдресаДоставки/AMS_АдресаДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AMS_АдресаДоставки</name>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ams/src/Documents/AMS_ЛогистическийЛист/Forms/ПодборДокументовВТранспорт/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();

	Данные = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);

	Дата                   = Данные.Дата;
	ТранспортноеСредство   = Данные.ТранспортноеСредство;
	РаспоряженияДляПобдора = Данные.РаспоряженияДляПобдора;
	Рейс                   = Данные.Рейс;
	РаспоряженияДляАвто    = Данные.РаспоряженияДляАвто;
	МассивЗагрузок         = Данные.МассивЗагрузок;

	Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТранспортноеСредство,
		"_Водитель,_Перевозчик,_СтавкаВодителя,_СтавкаАгента,_СтоимостьПропуска,ГрузоподъемностьВТоннах,AMS_КоличествоПалет");

	Если Рейс = Неопределено Тогда
		Пробег            = 0;
		Водитель          = Стр._Водитель;
		ВремяЗагрузки     = НачалоДня(Дата) + 3600 * 8;
		СтавкаВодителя    = Стр._СтавкаВодителя;
		СтоимостьПропуска = Стр._СтоимостьПропуска;
		СтавкаАгента      = Стр._СтавкаАгента;
		Коэффициент       = 1;
		СтоимостьДоставки = СтавкаВодителя + СтоимостьПропуска;
	Иначе
		Пробег            = Рейс.Пробег;
		Водитель          = Рейс.Водитель;
		ВремяЗагрузки     = Рейс.ВремяЗагрузки;
		СтавкаВодителя    = Рейс.СтавкаВодителя;
		СтоимостьПропуска = Рейс.СтоимостьПропуска;
		Коэффициент       = ?(Рейс.Коэффициент = 0, 1, Рейс.Коэффициент);
		СтоимостьДоставки = Рейс.СтоимостьДоставки;
		СтавкаАгента      = Рейс.СтавкаАгента;
	КонецЕсли;
	
	ПалетЕмкость = Стр.AMS_КоличествоПалет;
	ВесЕмкость   = Стр.ГрузоподъемностьВТоннах;
	Перевозчик   = Стр._Перевозчик;
	СтавкаАгента = Стр._СтавкаАгента;

	Элементы.СтавкаАгента.Видимость = СтавкаАгента > 0;

	ПалетЕмкость1 = ПалетЕмкость;
	ВесЕмкость1   = ВесЕмкость;

	ЗагрузкаДата  = НачалоДня(ВремяЗагрузки);
	ЗагрузкаВремя = Дата(1, 1, 1) + (ВремяЗагрузки - НачалоДня(ВремяЗагрузки));

	Распоряжения.Загрузить(РаспоряженияДляПобдора);

	Таб = ПолучитьДанныеРаспоряжений(РаспоряженияДляАвто);
	
	Для Каждого Стр Из Таб Цикл
		НовСтр = Распоряжения.Добавить();

		ЗаполнитьЗначенияСвойств(НовСтр, Стр);

		НовСтр.Метка = Истина;

		Если Стр.УтвержденаОтгрузка Тогда
			НовСтр.КоличествоПалетИнфо = Строка(Стр.КоличествоПалет);
			НовСтр.ВесИнфо             = Формат(Стр.Вес, "ЧДЦ=1");
		Иначе
			НовСтр.КоличествоПалетИнфо = ?(Стр.КоличествоПалетПлан = 0 Или Стр.КоличествоПалетПлан = Стр.КоличествоПалет, 
				Строка(Стр.КоличествоПалет), Строка(Стр.КоличествоПалетПлан) + "/" + Строка(Стр.КоличествоПалет));
			
			НовСтр.ВесИнфо = ?(Стр.ВесПлан = 0 Или Стр.ВесПлан = Стр.Вес, 
				Формат(Стр.Вес, "ЧДЦ=1"), Формат(Стр.ВесПлан, "ЧДЦ=1") + "/" + Формат(Стр.Вес, "ЧДЦ=1"));
		КонецЕсли;

		НовСтр.ВремяДоставки = Формат(Стр.ВремяДоставкиС, "ДФ=""ЧЧ:мм""") + "-" + Формат(Стр.ВремяДоставкиПо, "ДФ=""ЧЧ:мм""");
		НовСтр.Расстояние    = Стр.Расстояние;
		НовСтр.Номер         = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Стр.Номер);
	КонецЦикла;

	Распоряжения.Сортировать("Подвоз, ПартнерНаименование, АдресДоставки");

	Для Каждого Элемент Из МассивЗагрузок Цикл
		НовСтр = ЧасыЗагрузки.Добавить();
		НовСтр.ВремяЗагрузки = Элемент;
	КонецЦикла;
	
	ПоказатьНомерЗагрузки();

	ЗаполнитьТабРезультат();

	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ЗагрузкаВремя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ЗаписатьВодителяАвто(ТранспортноеСредство, Водитель);
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПропускаПриИзменении(Элемент)
	СтоимостьДоставки = СтавкаВодителя * Коэффициент + СтоимостьПропуска;
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентПриИзменении(Элемент)
	СтоимостьДоставки = СтавкаВодителя * Коэффициент + СтоимостьПропуска;
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьДоставкиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДатаПриИзменении(Элемент)
	Модифицированность = Истина;

	ПоказатьНомерЗагрузки();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаВремяПриИзменении(Элемент)
	Модифицированность = Истина;

	ПоказатьНомерЗагрузки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспоряжения

&НаКлиенте
Процедура РаспоряженияПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Распоряжение = Элемент.ТекущиеДанные.Распоряжение;

	Если ЗначениеЗаполнено(Распоряжение) И ТипЗнч(Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ОсобыеУсловияПеревозкиОписание = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(
			Элемент.ТекущиеДанные.Распоряжение, "ОсобыеУсловияПеревозкиОписание");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияМеткаПриИзменении(Элемент)
	ТекДанные = ТекущийЭлемент.ТекущиеДанные;

	Если ТекДанные.Метка Тогда
		ДобавитьСтрокуМаршрута(ТекДанные.Распоряжение);
	Иначе
		УдалитьСтрокуМаршрута(ТекДанные.Распоряжение);
	КонецЕсли;

	ЗаполнитьТабРезультат();

	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Если ПалетОстаток < 0 Или ВесОстаток < 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
		ТекстВопроса = "Перегруз. Продолжить?";

		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Вопрос");

	Иначе
		ЗакрытьФорму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Вниз(Команда)
	Стр = Элементы.Результат.ТекущиеДанные;

	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Результат.Сдвинуть(Результат.Индекс(Стр), 1);
	Исключение
		Возврат;
	КонецПопытки;

	УстановитьПорядокВМаршруте();

	Для Каждого Строка Из Результат Цикл
		Если Строка.Номер = Стр.Номер Тогда
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Элементы.Результат.ТекущаяСтрока = ИдентификаторСтроки;

	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Вверх(Команда)
	Стр = Элементы.Результат.ТекущиеДанные;

	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Результат.Сдвинуть(Результат.Индекс(Стр), -1);
	Исключение
		Возврат;
	КонецПопытки;

	УстановитьПорядокВМаршруте();

	Для Каждого Строка Из Результат Цикл
		Если Строка.Номер = Стр.Номер Тогда
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Элементы.Результат.ТекущаяСтрока = ИдентификаторСтроки;

	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиТаблицыФормыРезультат

&НаСервере
Процедура ЗаполнитьТабРезультат()
	Доставка = Ложь;
	Подвоз   = Ложь;

	ПалетЗагружено = 0;
	ВесЗагружено   = 0;

	ПалетЗагружено1 = 0;
	ВесЗагружено1   = 0;

	Результат.Очистить();

	Для Каждого Стр Из Распоряжения Цикл
		Если Стр.Метка Тогда
			НовСтр = Результат.Добавить();

			ЗаполнитьЗначенияСвойств(НовСтр, Стр);

			Если НовСтр.Подвоз = Ложь Тогда
				Доставка = Истина;
				ПалетЗагружено = ПалетЗагружено + ?(Стр.КоличествоПалетПлан = 0, Стр.КоличествоПалет, Стр.КоличествоПалетПлан);
				ВесЗагружено   = ВесЗагружено + ?(Стр.ВесПлан = 0, Стр.Вес, Стр.ВесПлан);
			Иначе
				Подвоз = Истина;
				ПалетЗагружено1 = ПалетЗагружено1 + Стр.КоличествоПалет;
				ВесЗагружено1   = ВесЗагружено1 + Стр.Вес;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Результат.Сортировать("ПорядокВМаршруте");

	ПалетОстаток = ПалетЕмкость - ПалетЗагружено;
	ВесОстаток   = ВесЕмкость - ВесЗагружено;

	ПалетОстаток1 = ПалетЕмкость1 - ПалетЗагружено1;
	ВесОстаток1   = ВесЕмкость1 - ВесЗагружено1;

	Элементы.ГруппаВес.Видимость = Доставка;
	Элементы.ГруппаПодвоз.Видимость   = Подвоз;
КонецПроцедуры

&НаСервере
Процедура УстановитьПорядокВМаршруте()
	Табл = РеквизитФормыВЗначение("Результат");
	Для Каждого Стр Из Табл Цикл
		Стр.ПорядокВМаршруте = Табл.Индекс(Стр) + 1;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Табл, "Результат");

	Табл = РеквизитФормыВЗначение("Распоряжения");
	Для Каждого Стр Из Результат Цикл
		НовСтр = Табл.Найти(Стр.Распоряжение, "Распоряжение");
		НовСтр.ПорядокВМаршруте = Стр.ПорядокВМаршруте;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Табл, "Распоряжения");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТаблицыФормыРаспоряжения

&НаСервереБезКонтекста
Функция ПолучитьДанныеРаспоряжений(РаспоряженияДляАвто)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РаспоряженияДляАвто", РаспоряженияДляАвто);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Распоряжение КАК Распоряжение,
	|	т.ПорядокВМаршруте КАК ПорядокВМаршруте
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	&РаспоряженияДляАвто КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Ссылка КАК Распоряжение,
	|	т.ЗонаДоставки КАК ЗонаДоставки,
	|	т.AMS_КоличествоПалет КАК КоличествоПалет,
	|	т.AMS_КоличествоПалет КАК КоличествоПалетПлан,
	|	т.AMS_Вес КАК Вес,
	|	т.AMS_ВесПлан КАК ВесПлан,
	|	т.ВремяДоставкиС КАК ВремяДоставкиС,
	|	т.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	т.Номер КАК Номер,
	|	т.Дата КАК Дата,
	|	т.Партнер КАК Партнер,
	|	т.СуммаДокумента КАК СуммаДокумента,
	|	ЛОЖЬ КАК УтвержденаОтгрузка,
	|	1 КАК Порядок,
	|	ЛОЖЬ КАК Подвоз,
	|	Док.ПорядокВМаршруте КАК ПорядокВМаршруте
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК т
	|		ПО Док.Распоряжение = т.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Ссылка,
	|	т.ЗонаДоставки,
	|	т.AMS_КоличествоПалет,
	|	т.AMS_КоличествоПалетПлан,
	|	т.AMS_Вес,
	|	т.AMS_ВесПлан,
	|	т.ВремяДоставкиС,
	|	т.ВремяДоставкиПо,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ,
	|	т.Номер,
	|	т.Дата,
	|	т.Партнер,
	|	т.СуммаДокумента,
	|	т.AMS_УтвержденаОтгрузка,
	|	2,
	|	ЛОЖЬ,
	|	Док.ПорядокВМаршруте
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК т
	|		ПО Док.Распоряжение = т.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Ссылка,
	|	т.ЗонаДоставки,
	|	т.AMS_КоличествоПалет,
	|	т.AMS_КоличествоПалет,
	|	т.AMS_Вес,
	|	т.AMS_Вес,
	|	т.ВремяДоставкиС,
	|	т.ВремяДоставкиПо,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ,
	|	т.Номер,
	|	т.Дата,
	|	т.Партнер,
	|	т.СуммаДокумента,
	|	ЛОЖЬ,
	|	3,
	|	ЛОЖЬ,
	|	Док.ПорядокВМаршруте
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтгрузкаТоваровКлиенту КАК т
	|		ПО Док.Распоряжение = т.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Ссылка,
	|	т.ЗонаДоставки,
	|	т.AMS_КоличествоПалет,
	|	т.AMS_КоличествоПалет,
	|	т.AMS_Вес,
	|	т.AMS_Вес,
	|	т.ВремяДоставкиС,
	|	т.ВремяДоставкиПо,
	|	т.АдресДоставки,
	|	т.Номер,
	|	т.Дата,
	|	т.Партнер,
	|	т.СуммаДокумента,
	|	ЛОЖЬ,
	|	4,
	|	ЛОЖЬ,
	|	Док.ПорядокВМаршруте
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю КАК т
	|		ПО Док.Распоряжение = т.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Ссылка,
	|	т.ЗонаДоставки,
	|	т.AMS_КоличествоПалет,
	|	т.AMS_КоличествоПалет,
	|	т.AMS_Вес,
	|	т.AMS_Вес,
	|	т.ВремяДоставкиС,
	|	т.ВремяДоставкиПо,
	|	т.АдресДоставки,
	|	т.Номер,
	|	т.Дата,
	|	т.Партнер,
	|	т.СуммаДокумента,
	|	ЛОЖЬ,
	|	5,
	|	ЛОЖЬ,
	|	Док.ПорядокВМаршруте
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПередачаВПереработку КАК т
	|		ПО Док.Распоряжение = т.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Ссылка,
	|	т.ЗонаДоставки,
	|	т.AMS_КоличествоПалет,
	|	т.AMS_КоличествоПалет,
	|	т.AMS_Вес,
	|	т.AMS_Вес,
	|	т.ВремяДоставкиС,
	|	т.ВремяДоставкиПо,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ,
	|	т.Номер,
	|	т.Дата,
	|	т.Партнер,
	|	т.СуммаДокумента,
	|	ЛОЖЬ,
	|	6,
	|	ИСТИНА,
	|	Док.ПорядокВМаршруте
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК т
	|		ПО Док.Распоряжение = т.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Ссылка,
	|	т.ЗонаДоставки,
	|	т.AMS_КоличествоПалет,
	|	т.AMS_КоличествоПалет,
	|	т.AMS_Вес,
	|	т.AMS_Вес,
	|	т.ВремяДоставкиС,
	|	т.ВремяДоставкиПо,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ,
	|	т.Номер,
	|	т.Дата,
	|	т.Партнер,
	|	т.СуммаДокумента,
	|	ЛОЖЬ,
	|	7,
	|	ИСТИНА,
	|	Док.ПорядокВМаршруте
	|ИЗ
	|	Док КАК Док
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК т
	|		ПО Док.Распоряжение = т.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Распоряжение КАК Распоряжение,
	|	МАКСИМУМ(Адреса.Расстояние) КАК Расстояние
	|ПОМЕСТИТЬ Км
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АдресаДоставки КАК Адреса
	|		ПО вт.АдресДоставки = Адреса.Наименование
	|СГРУППИРОВАТЬ ПО
	|	вт.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Распоряжение КАК Распоряжение,
	|	вт.ЗонаДоставки КАК ЗонаДоставки,
	|	вт.КоличествоПалет КАК КоличествоПалет,
	|	вт.КоличествоПалетПлан КАК КоличествоПалетПлан,
	|	вт.Вес КАК Вес,
	|	вт.ВесПлан КАК ВесПлан,
	|	вт.ВремяДоставкиС КАК ВремяДоставкиС,
	|	вт.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	вт.АдресДоставки КАК АдресДоставки,
	|	вт.Номер КАК Номер,
	|	вт.Дата КАК Дата,
	|	вт.Партнер КАК Партнер,
	|	вт.СуммаДокумента КАК СуммаДокумента,
	|	вт.УтвержденаОтгрузка КАК УтвержденаОтгрузка,
	|	Км.Расстояние КАК Расстояние,
	|	вт.Порядок КАК Порядок,
	|	вт.Подвоз КАК Подвоз,
	|	вт.Партнер.Наименование КАК ПартнерНаименование,
	|	вт.ПорядокВМаршруте КАК ПорядокВМаршруте
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Км КАК Км
	|		ПО вт.Распоряжение = Км.Распоряжение";

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Процедура ДобавитьСтрокуМаршрута(Распоряжение)
	Строки = Распоряжения.НайтиСтроки(Новый Структура("Распоряжение", Распоряжение));
	Строки[0].ПорядокВМаршруте = Результат.Количество() + 1;
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуМаршрута(Распоряжение)
	Строки = Распоряжения.НайтиСтроки(Новый Структура("Распоряжение", Распоряжение));
	Строки[0].ПорядокВМаршруте = 0;

	Строки = Результат.НайтиСтроки(Новый Структура("Распоряжение", Распоряжение));
	Результат.Удалить(Результат.Индекс(Строки[0]));

	УстановитьПорядокВМаршруте();
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыЗаписиДанных

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьФорму();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	Отказ = Ложь;

	ПроверитьРезультат(Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Ложь; //Снятие модифицированности, т.к. перед закрытием признак проверяется

	Закрыть(ПолучитьМассивРезультата());
КонецПроцедуры

&НаСервере
Процедура ПроверитьРезультат(Отказ)
	Если ЗагрузкаДата = Дата(1, 1, 1) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указана Дата начала загрузки.", , , , Отказ);
	КонецЕсли;

	Если ЗагрузкаВремя = Дата(1, 1, 1) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указано Время начала загрузки.", , , , Отказ);
	КонецЕсли;
	
	Перевозчик   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТранспортноеСредство, "_Перевозчик");
	Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Перевозчик, "Наименование");

	Если СтоимостьДоставки = 0 И СтрНайти(Наименование, "АМС Медиа") = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указана Стоимость доставки.", , , , Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивРезультата()
	МассивУПД = Новый Массив;
	
	Для Каждого Стр Из Результат Цикл
		Если ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			Или ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента")
			Или ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.AMS_ПередачаВПереработку")
			Или ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.ПередачаТоваровХранителю") Тогда
			Подвоз  = Ложь;
		Иначе
			Подвоз  = Истина;
		КонецЕсли;

		НовСтр = Новый Структура;
		НовСтр.Вставить("ТранспортноеСредство", ТранспортноеСредство);
		НовСтр.Вставить("Подвоз", Подвоз);

		НовСтр.Вставить("ПорядокВМаршруте", Стр.ПорядокВМаршруте);
		НовСтр.Вставить("Распоряжение", Стр.Распоряжение);
		НовСтр.Вставить("АдресДоставки", Стр.АдресДоставки);
		НовСтр.Вставить("Расстояние", Стр.Расстояние);

		МассивУПД.Добавить(НовСтр);
	КонецЦикла;

	Рейс = Новый Структура;
	Рейс.Вставить("ТранспортноеСредство", ТранспортноеСредство);
	Рейс.Вставить("Водитель", Водитель);
	Рейс.Вставить("ВремяЗагрузки", '00010101000000' + (ЗагрузкаДата - '00010101000000') + (ЗагрузкаВремя
		- '00010101000000'));
	Рейс.Вставить("СтавкаВодителя", СтавкаВодителя);
	Рейс.Вставить("СтавкаАгента", СтавкаАгента);
	Рейс.Вставить("Коэффициент", Коэффициент);
	Рейс.Вставить("СтоимостьПропуска", СтоимостьПропуска);
	Рейс.Вставить("СтоимостьДоставки", СтоимостьДоставки);
	Рейс.Вставить("Пробег", Пробег);

	Данные = Новый Структура;
	Данные.Вставить("Рейс", Рейс);
	Данные.Вставить("МассивУПД", МассивУПД);

	Возврат Данные;
КонецФункции

#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();
	
	//Результат: Загрузка утверждена менеджером - цвет фона зеленый
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Результат.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Результат.УтвержденаОтгрузка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветТекстаКонтрагентаДействующего);
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РезультатЗонаДоставки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Результат.ЗонаДоставки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.ЗоныДоставки.ПустаяСсылка();

	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , , Истина));
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<зона не указана>'"));
	
	//Результат: ОбъединеннаяЗагрузка шрифт ЖИРНЫЙ
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Результат.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Результат.ФлагОЗ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , , , Истина));
	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Результат.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Результат.Подвоз");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки);
	
	//Распоряжения: Заказ клиента - цвет фона розовый
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Распоряжения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Распоряжения.Порядок");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ФонПодписьНеверна);
	
	//Распоряжения
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспоряженияЗонаДоставки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Распоряжения.ЗонаДоставки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.ЗоныДоставки.ПустаяСсылка();

	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , , Истина));
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<зона не указана>'"));
	
	//Распоряжения: Загрузка утверждена менеджером - цвет фона зеленый
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Распоряжения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Распоряжения.УтвержденаОтгрузка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветТекстаКонтрагентаДействующего);
	
	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Распоряжения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Распоряжения.Подвоз");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки);
	
	//Распоряжения: ОбъединеннаяЗагрузка шрифт ПОДЧЕРКНУТЬ
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Распоряжения.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Распоряжения.ФлагОЗ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	//@skip-check new-font
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(, , , , Истина));
КонецПроцедуры

&НаСервере
Процедура ПоказатьНомерЗагрузки()
	ВремяЗагрузки = '00010101000000' + (ЗагрузкаДата - '00010101000000') + (ЗагрузкаВремя - '00010101000000');

	НомерЗагрузки = ЧасыЗагрузки.НайтиСтроки(Новый Структура("ВремяЗагрузки", ВремяЗагрузки)).Количество() + 1;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьВодителяАвто(ТранспортноеСредство, Водитель)
	Авто = ТранспортноеСредство.ПолучитьОбъект();
	Авто._Водитель = Водитель;
	Авто.Записать();
КонецПроцедуры

#КонецОбласти
